In [1]:
import pandas as pd

In [14]:
pip install xmltodict

Requirement already satisfied: xmltodict in c:\users\91999\anaconda3\lib\site-packages (0.13.0)
Note: you may need to restart the kernel to use updated packages.

In [45]:
import xmltodict
with open('regions.xml') as  xml_file:
    d1 = xmltodict.parse(xml_file.read())
d1

{'data': {'region': [{'id': '1', 'name': 'North', 'manager': 'Mary Johnson'},
   {'id': '2', 'name': 'South', 'manager': 'Robert Lee'},
   {'id': '3', 'name': 'East', 'manager': 'Patricia Williams'},
   {'id': '4', 'name': 'West', 'manager': 'James Brown'}]}}

In [47]:
region = d1['data']['region']
region

[{'id': '1', 'name': 'North', 'manager': 'Mary Johnson'},
 {'id': '2', 'name': 'South', 'manager': 'Robert Lee'},
 {'id': '3', 'name': 'East', 'manager': 'Patricia Williams'},
 {'id': '4', 'name': 'West', 'manager': 'James Brown'}]

In [18]:
for employee in region:
    print(f"id:{employee['id']},name:{employee['name']},manager:{employee['manager']}")

id:1,name:North,manager:Mary Johnson
id:2,name:South,manager:Robert Lee
id:3,name:East,manager:Patricia Williams
id:4,name:West,manager:James Brown

In [56]:
d2 = pd.read_csv("customers.csv")
print(d2)

   customer_id           name  age          city
0            1       John Doe   28      New York
1            2     Jane Smith   34   Los Angeles
2            3    Emily Davis   22       Chicago
3            4  Michael Brown   45       Houston
4            5  Linda Johnson   31  Philadelphia

In [57]:
d2.describe()

       customer_id        age
count     5.000000   5.000000
mean      3.000000  32.000000
std       1.581139   8.514693
min       1.000000  22.000000
25%       2.000000  28.000000
50%       3.000000  31.000000
75%       4.000000  34.000000
max       5.000000  45.000000

In [58]:
d2['name']

0         John Doe
1       Jane Smith
2      Emily Davis
3    Michael Brown
4    Linda Johnson
Name: name, dtype: object

In [59]:
d2.nunique()

customer_id    5
name           5
age            5
city           5
dtype: int64

In [61]:
d2.columns

Index(['customer_id', 'name', 'age', 'city'], dtype='object')

In [60]:
d2.sort_values(by = "name")

   customer_id           name  age          city
2            3    Emily Davis   22       Chicago
1            2     Jane Smith   34   Los Angeles
0            1       John Doe   28      New York
4            5  Linda Johnson   31  Philadelphia
3            4  Michael Brown   45       Houston

In [62]:
d2.sort_values(by = "age", ascending=False)

   customer_id           name  age          city
3            4  Michael Brown   45       Houston
1            2     Jane Smith   34   Los Angeles
4            5  Linda Johnson   31  Philadelphia
0            1       John Doe   28      New York
2            3    Emily Davis   22       Chicago

In [79]:
d3 = pd.read_json("products.json")
print(d3)

   product_id        name     category  price
0           1      Laptop  Electronics   1000
1           2  Smartphone  Electronics    800
2           3        Desk    Furniture    150
3           4       Chair    Furniture    100

In [80]:
d3.describe

<bound method NDFrame.describe of    product_id        name     category  price
0           1      Laptop  Electronics   1000
1           2  Smartphone  Electronics    800
2           3        Desk    Furniture    150
3           4       Chair    Furniture    100>

In [81]:
d3.size

16

In [82]:
d3.nunique()

product_id    4
name          4
category      2
price         4
dtype: int64

In [83]:
d3.columns

Index(['product_id', 'name', 'category', 'price'], dtype='object')

In [84]:
d4 = pd.read_csv("sales.txt", delimiter ='\t')
print(d4)

   sale_id  product_id  customer_id  amount        date
0      101           1            1   150.0  2023-01-15
1      102           2            2   200.0  2023-01-16
2      103           1            3   120.0  2023-01-17
3      104           3            4   300.0  2023-01-18
4      105           2            5   250.0  2023-01-19

In [85]:
d5 = pd.read_csv("task.txt")
print(d5)

  Combine all the acquired data into a single DataFrame for analysis.
0  https://raw.githubusercontent.com/datascienced...

In [86]:
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'
d6 = pd.read_csv(url)
d6.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S